{
  "vulnerable": {
    "idx": 210896,
    "project": "spice",
    "commit_id": "a4a16ac42d2f19a17e36556546aa94d5cd83745f",
    "commit_url": "https://gitlab.freedesktop.org/spice/spice/commit/a4a16ac42d2f19a17e36556546aa94d5cd83745f",
    "commit_message": "memslot: Fix off-by-one error in group/slot boundary check\n\nRedMemSlotInfo keeps an array of groups, and each group contains an\narray of slots. Unfortunately, these checks are off by 1, they check\nthat the index is greater or equal to the number of elements in the\narray, while these arrays are 0 based. The check should only check for\nstrictly greater than the number of elements.\n\nFor the group array, this is not a big issue, as these memslot groups\nare created by spice-server users (eg QEMU), and the group ids used to\nindex that array are also generated by the spice-server user, so it\nshould not be possible for the guest to set them to arbitrary values.\n\nThe slot id is more problematic, as it's calculated from a QXLPHYSICAL\naddress, and such addresses are usually set by the guest QXL driver, so\nthe guest can set these to arbitrary values, including malicious values,\nwhich are probably easy to build from the guest PCI configuration.\n\nThis patch fixes the arrays bound check, and adds a test case for this.\nThis fixes CVE-2019-3813.\n\nSigned-off-by: Christophe Fergeau <cfergeau@redhat.com>\nAcked-by: Frediano Ziglio <fziglio@redhat.com>",
    "cve": "CVE-2019-3813",
    "cve_desc": "Spice, versions 0.5.2 through 0.14.1, are vulnerable to an out-of-bounds read due to an off-by-one error in memslot_get_virt. This may lead to a denial of service, or, in the worst case, code-execution by unauthenticated attackers.",
    "cwe": [
      "CWE-193"
    ],
    "nvd_url": "https://nvd.nist.gov/vuln/detail/CVE-2019-3813",
    "file_name": "memslot.c",
    "func_hash": 339666083531536346198123409033012275535,
    "file_hash": 314430538622797217223560939109800616180
  },
  "fixed": {
    "idx": 442587,
    "func_hash": 316300758635752588909124078674988704544,
    "file_hash": 44209429737432775835092242401604898921
  }
}